app/views/books/index.html.erb

        <td>
          <% if book.borrowings.where(returned_date: nil).exists? %>
---
SELECT 1 AS one FROM "borrowings" WHERE "borrowings"."book_id" = 1 AND "borrowings"."returned_date" IS NULL LIMIT 1