app/views/books/show.html.erb

      <strong>Status:</strong>
      <% if @book.borrowings.where(returned_date: nil).exists? %>
---
SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."book_id" = 1 AND "borrowings"."returned_date" IS NULL ORDER BY "borrowings"."id" ASC LIMIT 1
SELECT 1 AS one FROM "borrowings" WHERE "borrowings"."book_id" = 1 AND "borrowings"."returned_date" IS NULL LIMIT 1

    <% if user_signed_in? %>
      <% if @book.borrowings.where(returned_date: nil).exists? %>
        <% if @book.borrowings.where(returned_date: nil).first.user == current_user %>
          <%= button_to 'Return Book', return_book_borrowing_path(@book.borrowings.where(returned_date: nil).first),
              method: :patch,
              class: 'button return-button' %>
---
SELECT 1 AS one FROM "borrowings" WHERE "borrowings"."book_id" = 1 AND "borrowings"."returned_date" IS NULL LIMIT 1
SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."book_id" = 1 AND "borrowings"."returned_date" IS NULL ORDER BY "borrowings"."id" ASC LIMIT 1