app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "author", "isbn", "created_at", "updated_at") VALUES ('how to get rich', 'Levi kigunda', '22334-44575', '2025-02-14 16:25:31.165175', '2025-02-14 16:25:31.165175') RETURNING "id"