app/controllers/borrowings_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
INSERT INTO "borrowings" ("user_id", "book_id", "borrowed_date", "due_date", "returned_date", "created_at", "updated_at") VALUES (1, 1, '2025-02-14 07:35:38.789266', '2025-02-28 07:35:38.789363', NULL, '2025-02-14 07:35:38.839260', '2025-02-14 07:35:38.839260') RETURNING "id"
---
  def create
    @book = Book.find(params[:book_id])
    @borrowing = current_user.borrowings.build(
      book: @book,
      borrowed_date: Time.current,
      due_date: 2.weeks.from_now
    )

    if @borrowing.save

SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."user_id" = 1 AND "borrowings"."id" = 1 LIMIT 1
UPDATE "borrowings" SET "returned_date" = '2025-02-14 07:36:01.555537', "updated_at" = '2025-02-14 07:36:01.561270' WHERE "borrowings"."id" = 1
---
  def return_book
    @borrowing = current_user.borrowings.find(params[:id])
    @borrowing.update(returned_date: Time.current)