app/controllers/profiles_controller.rb

SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."user_id" = 1 AND "borrowings"."returned_date" IS NOT NULL
---
  def show
    @current_borrowings = current_user.borrowings.where(returned_date: nil)